zeha/xc32/pic32m-source/gcc/gcc/config/mchp-cci/cci.c
/* Subroutines used for Microchip PIC32 MCU support
   Copyright (C) 2017
   Microchip Technology, Inc.

This file is part of Microchip XC compiler tool-chain.

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 3, or (at your option)
any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with GCC; see the file COPYING3.  If not see
<http://www.gnu.org/licenses/>.  */

/*
 *  Common CCI definitions for Microchip Compilers
 */

#ifdef _BUILD_MCHP_

/* MERGE-TODO: this file is basically two different things in the mips/arm 
   versions. fix it. */

#ifndef TARGET_MCHP_PIC32MX

#include "config.h"
#include "system.h"
#include "coretypes.h"
#include "backend.h"
#include "target.h"
#include "varasm.h"
#include "output.h"
#include "tree-core.h"
#include "tree.h"
#include "memmodel.h"
#include "gimple.h"
#include "cfghooks.h"
#include "df.h"
#include "tm_p.h"
#include "stringpool.h"
#include "cgraph.h"
#include "alias.h"
#include "fold-const.h"
#include "stor-layout.h"
#include "calls.h"
#include "explow.h"
#include "libfuncs.h"
#include "common/common-target.h"
#include "langhooks.h"
#include "cfgrtl.h"
#include "cfganal.h"
#include "sched-int.h"
#include "gimplify.h"
#include "tree-pass.h"
#include "context.h"
#include "target-globals.h"
#include "builtins.h"
#include "c-family/c-common.h"
#include "c-family/c-pragma.h"
#include "c/c-tree.h"
#include "diagnostic.h"
#include "config/pic32c/pic32c-protos.h"

void mchp_print_builtin_function (const_tree t)
{
  if (TARGET_WRITE_BUILTINS_H && t && DECL_P(t))
	pretty_tree_with_prototype(const_cast<tree> (t));
    
  if (TARGET_PRINT_BUILTINS && t && DECL_P(t))
	puts (IDENTIFIER_POINTER(DECL_NAME(t)));
}


void mchp_close_builtin_header ()
{
    close_builtins_h();
}

#else /* TARGET_MCHP_PIC32MX */

#define CCI_H "config/mchp-cci/cci.h"
#include CCI_H

#ifdef _BUILD_C30_
#define TARGET_C30 1
#else
#define TARGET_C30 0
#endif
#ifdef _BUILD_C32_
#define TARGET_C32 1
#define MCHP_ALLOW_INTEGER_CONFIGVALUE
#else
#define TARGET_C32 0
#endif
#define TARGET_MCHP 1

/* Temporarily move this stuff to cci-backend.c for XC32 */
#ifndef _BUILD_C32_

static void cci_define(void *pfile_v, const char *keyword, const char *target) {
  struct cpp_reader *pfile = (struct cpp_reader *)pfile_v;
  char *buffer=NULL;

  if (target)
    {
      buffer = (char *)xmalloc(strlen(keyword) + strlen(target) + 6);
      sprintf(buffer,"%s=%s", keyword, target);
    }
  else
    {
      buffer = (char *)xmalloc(strlen(keyword) + strlen("=") + 6);
      sprintf(buffer,"%s=", keyword);
    }
  if (buffer != NULL) 
    {
      cpp_define(pfile, buffer);
      free(buffer);
    }
  return;
}

static void cci_attribute(void *pfile_v,const char *keyword, const char *target,
                   int varargs, int n) {
  struct cpp_reader *pfile = (struct cpp_reader *)pfile_v;
  int params_specified = 0;
  char *buffer=NULL,*c=NULL;
  int size;
  int i;

  if (n) {
    for (c = (char *)target; *c; c++) {
      if ((*c == 'P') && (c[1] >= '0') && (c[1] <= '9')) {
        params_specified=1;
        break;
      }
    }
  }
  size = strlen(keyword)+1+sizeof("= __attribute__(())")+strlen(target)+1;
  if (n) {
    if (params_specified == 0) {
      size += 8 * n;  /* up to 99 params: Pnn, */
    } else {
      size += strlen(target) + strlen("()\n");
    }
  }
  if (varargs) size += strlen("=()(),...__VA_ARGS__");
  buffer = (char *)xcalloc(size,sizeof(char));
  c = buffer;
  c += sprintf(c,"%s",keyword);
  if (n || varargs) {
    *c++ = '(';
    for (i = 1; i <= n; i++) {
      c += sprintf(c, "P%d", i);
      if (i < n) *c += ',';
    }
    if (varargs) {
      if (n) *c++=',';
      c += sprintf(c, "...");
    }
    *c++ = ')';
  }
  c += sprintf(c, "=__attribute__((%s", target);
  if ((n || varargs) && !params_specified) {
    *c++ = '(';
    for (i = 1; i <= n; i++) {
      c += sprintf(c, "P%d", i);
      if (i < n) *c += ',';
    }
    if (varargs) {
      if (n) *c++=',';
      c += sprintf(c, "__VA_ARGS__");
    }
    *c++ = ')';
  }
  *c++ = ')';
  *c++ = ')';
  *c++ = 0;
  if (buffer != NULL) 
    {
      cpp_define(pfile, buffer);
      free(buffer);
    }
}

static void set_value(unsigned int *loc, unsigned int value) {
 *loc = value;
}

/*
 * call from TARGET_CPU_CPP_BUILTINS
 */

void mchp_init_cci(void *pfile_v) {
  struct cpp_reader *pfile = (struct cpp_reader *)pfile_v;

#define CCI
#define CCI_DEFINE(TARGET, CCI_KEYWORD, TGT_KEYWORD, N) \
  if (TARGET) \
    cci_define(pfile_v, CCI_KEYWORD, TGT_KEYWORD);
#include CCI_H

#define CCI
#define CCI_ATTRIBUTE(TARGET, CCI_KEYWORD, TGT_KEYWORD, N) \
  if (TARGET) \
    cci_attribute(pfile_v, CCI_KEYWORD, TGT_KEYWORD, 0, 0);
#include CCI_H

#define CCI
#define CCI_ATTRIBUTE_N(TARGET, CCI_KEYWORD, TGT_KEYWORD, N) \
  if (TARGET) \
    cci_attribute(pfile_v, CCI_KEYWORD, TGT_KEYWORD, 0, N);
#include CCI_H

#define CCI
#define CCI_ATTRIBUTE_V(TARGET, CCI_KEYWORD, TGT_KEYWORD, N) \
  if (TARGET) \
    cci_attribute(pfile_v, CCI_KEYWORD, TGT_KEYWORD, 1, 0);
#include CCI_H

#define CCI
#define CCI_ATTRIBUTE_NV(TARGET, CCI_KEYWORD, TGT_KEYWORD, N) \
  if (TARGET) \
    cci_attribute(pfile_v, CCI_KEYWORD, TGT_KEYWORD, 1, N);
#include CCI_H

#define CCI
#define CCI_SET_VALUE(TARGET, CCI_KEYWORD, TGT_KEYWORD, N) \
  if (TARGET) \
    set_value(TGT_KEYWORD,N);
#include CCI_H

}

void mchp_init_cci_builtins(void) {

#define CCI
#define CCI_PRAGMA(TARGET, CCI_KEYWORD, TGT_FN, N) \
  if (TARGET) \
    c_register_pragma(0, CCI_KEYWORD, TGT_FN);
#include CCI_H

/*
 * Special case mapping
 *
 */
 if (IMPORT_MCHP("iar")) {
   // define builtins for the functions that we don't define
   //   and mark them as unsupported

   tree attrib, args;
   tree fn_type;

#  define MESSAGE "Intrinsic function is unsupported for this target"
   args = build_tree_list(NULL_TREE, build_string(strlen(MESSAGE), MESSAGE));
   attrib = build_tree_list(get_identifier("target_error"), args);
#  undef MESSAGE

   fn_type = build_function_type_list(void_type_node, void_type_node,NULL_TREE);
   add_builtin_function("__disable_fiq", fn_type, 0, BUILT_IN_MD, NULL, attrib);
   /*                                             ^ this should be okay
    *  because we are going to generate an error for it...
    */

   add_builtin_function("__disable_irq", fn_type, 0, BUILT_IN_MD, NULL, attrib);
   /*                                             ^ this should be okay
    *  because we are going to generate an error for it...
    */

   add_builtin_function("__enable_fiq", fn_type, 0, BUILT_IN_MD, NULL, attrib);
   /*                                            ^ this should be okay
    *  because we are going to generate an error for it...
    */

   add_builtin_function("__enable_irq", fn_type, 0, BUILT_IN_MD, NULL, attrib);
   /*                                            ^ this should be okay
    *  because we are going to generate an error for it...
    */
 }
}
#else /* XC32 only for now */

void mchp_init_cci_pragmas(void) {

#define CCI
#define CCI_PRAGMA(TARGET, CCI_KEYWORD, TGT_FN, N) \
  if (TARGET) \
    c_register_pragma(0, CCI_KEYWORD, (pragma_handler_1arg)TGT_FN);
#include CCI_H
}

#endif

/* handler function for the config pragma */
void
mchp_handle_config_pragma (ATTRIBUTE_UNUSED struct cpp_reader *pfile)
{
  enum cpp_ttype tok;
  tree tok_value;
  static int shown_no_config_warning = 0;
  
  if (flag_generate_lto && (flag_pic || flag_pie))
    {
      warning (0, "#pragma config not supported with -flto option, this file will not participate in LTO");
      flag_generate_lto = 0;
    }

  /* If we're compiling for the default device, we don't process
     configuration words */
  if (!mchp_processor_string)
    {
      error ("#pragma config directive not available for the "
             "default generic device, %s", mchp_processor_string);
      CLEAR_REST_OF_INPUT_LINE();
      return;
    }

  if (!mchp_config_data_dir)
    {
      error ("Configuration-word data directory not specified "
             "but required for #pragma config directive; has a valid device "
             "been selected?");
      CLEAR_REST_OF_INPUT_LINE();
      return;
    }

  /* the first time we see a config pragma, we need to load the
     configuration word data from the definition file. */
  if (!mchp_configuration_values)
    {
      /* alloc space for the filename: directory + '/' + "configuration.data"
       */
      char *fname = (char*)alloca (strlen (mchp_config_data_dir) + 1 +
                            strlen (MCHP_CONFIGURATION_DATA_FILENAME));
      strcpy (fname, mchp_config_data_dir);
      if (fname [strlen (fname) - 1] != '/'
          && fname [strlen (fname) - 1] != '\\')
        strcat (fname, "/");
      strcat (fname, MCHP_CONFIGURATION_DATA_FILENAME);

      if (mchp_load_configuration_definition (fname))
        {
          if (!shown_no_config_warning)
            {
              shown_no_config_warning = 1;
              warning (0, "Configuration word information not available for "
                       "this processor. #pragma config is ignored.");
            }
          CLEAR_REST_OF_INPUT_LINE();
          return;
        }
    }

  /* The payload for the config pragma is a comma delimited list of
     "setting = value" pairs. Both the setting and the value must
     be valid C identifiers. */
  tok = pragma_lex (&tok_value);
  while (1)
    {
      const char *setting_name;
      unsigned char *value_name;

      /* the current token should be the setting name */
      if (tok != CPP_NAME)
        {
          error ("configuration setting name expected in configuration pragma");
          break;
        }

      setting_name = IDENTIFIER_POINTER (tok_value);
      /* the next token should be the '=' */
      tok = pragma_lex (&tok_value);
      if (tok != CPP_EQ)
        {
          error ("'=' expected in configuration pragma");
          break;
        }
      /* now we have the value name. We don't use pragma_lex() to get this one
         since we don't want the additional interpretation going on there.
         i.e., converting integers from the string. */
      tok = pragma_lex (&tok_value);
      if (tok == CPP_NAME)
        mchp_handle_configuration_setting (setting_name,
          (const unsigned char *)IDENTIFIER_POINTER (tok_value));
      else if (tok == CPP_NUMBER)
        {
          //host_integerp (..., 0) with tree_fits_shwi_p
          if (tree_fits_shwi_p (tok_value))
          {
            #define MAX_VALUE_NAME_LENGTH 22
            unsigned HOST_WIDE_INT i;
            //Replace tree_low_cst (..., 0) with tree_to_shwi
            i = tree_to_shwi (tok_value);
            value_name = (unsigned char*)xcalloc(MAX_VALUE_NAME_LENGTH,1);
            snprintf((char *)value_name, MAX_VALUE_NAME_LENGTH, "%llu", i);
            mchp_handle_configuration_setting (setting_name, value_name);
            #undef MAX_VALUE_NAME_LENGTH
          }
          else
            {
              error ("config-setting value must be a valid integer constant");
              break;
            }
        }
      else
        {
          error ("config-setting value must be a name or a constant integer");
          break;
        }
      

      /* if the next token is ',' then we have another setting. */
      tok = pragma_lex (&tok_value);
      if (tok == CPP_COMMA)
        tok = pragma_lex (&tok_value);
      /* if it's EOF, we're done */
      else if (tok == CPP_EOF)
        break;
      /* otherwise, we have spurious input */
      else
        {
          error ("',' or end of line expected in configuration pragma");
          break;
        }
    }
  /* if we ended for any reason other than end of line, we have an error.
     Any needed diagnostic should have already been issued, so just
     clear the rest of the data on the line. */
  if (tok != CPP_EOF)
    CLEAR_REST_OF_INPUT_LINE();
}

#if defined(_BUILD_C32_)
void
mchp_handle_configset_pragma (ATTRIBUTE_UNUSED struct cpp_reader *pfile, const char* set)
{
  enum cpp_ttype tok;
  tree tok_value;
  static int shown_no_config_warning = 0;
  
  gcc_assert(strlen(set) < 5);

  /* If we're compiling for the default device, we don't process
     configuration words */
  if (!mchp_processor_string)
    {
      error ("#pragma config directive not available for the "
             "default generic device, %s", mchp_processor_string);
      CLEAR_REST_OF_INPUT_LINE();
      return;
    }

  if (!mchp_config_data_dir)
    {
      error ("Configuration-word data directory not specified "
             "but required for #pragma config directive; has a valid device "
             "been selected?");
      CLEAR_REST_OF_INPUT_LINE();
      return;
    }

  /* the first time we see a config pragma, we need to load the
     configuration word data from the definition file. */
  if (!mchp_configuration_values)
    {
      /* alloc space for the filename: directory + '/' + "configuration.data"
       */
      char *fname = (char*)alloca (strlen (mchp_config_data_dir) + 1 +
                            strlen (MCHP_CONFIGURATION_DATA_FILENAME));
      strcpy (fname, mchp_config_data_dir);
      if (fname [strlen (fname) - 1] != '/'
          && fname [strlen (fname) - 1] != '\\')
        strcat (fname, "/");
      strcat (fname, MCHP_CONFIGURATION_DATA_FILENAME);

      if (mchp_load_configuration_definition (fname))
        {
          if (!shown_no_config_warning)
            {
              shown_no_config_warning = 1;
              warning (0, "Configuration word information not available for "
                       "this processor. #pragma config is ignored.");
            }
          CLEAR_REST_OF_INPUT_LINE();
          return;
        }
    }

  /* The payload for the config pragma is a comma delimited list of
     "setting = value" pairs. Both the setting and the value must
     be valid C identifiers. */
  tok = pragma_lex (&tok_value);
  while (1)
    {
      const char *base_setting_name;
      char *setting_name;
      int length;
      unsigned char *value_name;

      /* the current token should be the setting name */
      if (tok != CPP_NAME)
        {
          error ("configuration setting name expected in configuration pragma");
          break;
        }

      /* Prepend the set name and an underscore to the base setting name.
         The set name should be all caps. Example: ABF1_FWDTEN  */
      base_setting_name = IDENTIFIER_POINTER (tok_value);
      length = 4 + 1 + strlen(base_setting_name) + 1; /* <set>_<setting>NULL */
      setting_name = (char*)xmalloc(length);
      snprintf (setting_name, length, "%s_%s", set, base_setting_name);
      
      /* the next token should be the '=' */
      tok = pragma_lex (&tok_value);
      if (tok != CPP_EQ)
        {
          error ("'=' expected in configuration pragma");
          break;
        }
      /* now we have the value name. We don't use pragma_lex() to get this one
         since we don't want the additional interpretation going on there.
         i.e., converting integers from the string. */
      tok = pragma_lex (&tok_value);
      if (tok == CPP_NAME)
        mchp_handle_configuration_setting (setting_name,
          (const unsigned char *)IDENTIFIER_POINTER (tok_value));
      else if (tok == CPP_NUMBER)
        {
          //host_integerp (..., 0) with tree_fits_shwi_p
          if (tree_fits_shwi_p (tok_value)) 
          {
            #define MAX_VALUE_NAME_LENGTH 22
            unsigned HOST_WIDE_INT i;
            //Replace tree_low_cst (..., 0) with tree_to_shwi
            i = tree_to_shwi (tok_value);
            value_name = (unsigned char*)xcalloc(MAX_VALUE_NAME_LENGTH,1);
            snprintf((char *)value_name, MAX_VALUE_NAME_LENGTH, "%llu", i);
            mchp_handle_configuration_setting (setting_name, value_name);
            #undef MAX_VALUE_NAME_LENGTH
          }
        }
      else
        {
          error ("config-setting value must be a name or a constant integer");
          break;
        }

      /* if the next token is ',' then we have another setting. */
      tok = pragma_lex (&tok_value);
      if (tok == CPP_COMMA)
        tok = pragma_lex (&tok_value);
      /* if it's EOF, we're done */
      else if (tok == CPP_EOF)
        break;
      /* otherwise, we have spurious input */
      else
        {
          error ("',' or end of line expected in configuration pragma");
          break;
        }
    }
  /* if we ended for any reason other than end of line, we have an error.
     Any needed diagnostic should have already been issued, so just
     clear the rest of the data on the line. */
  if (tok != CPP_EOF)
    CLEAR_REST_OF_INPUT_LINE();
}

void mchp_handle_config_alt_pragma(struct cpp_reader *pfile)
{
  mchp_handle_configset_pragma(pfile, "A");
}
void mchp_handle_config_bf1_pragma(struct cpp_reader *pfile)
{
  mchp_handle_configset_pragma(pfile, "BF1");
}
void mchp_handle_config_abf1_pragma(struct cpp_reader *pfile)
{
  mchp_handle_configset_pragma(pfile, "ABF1");
}
void mchp_handle_config_bf2_pragma(struct cpp_reader *pfile)
{
  mchp_handle_configset_pragma(pfile, "BF2");
}
void mchp_handle_config_abf2_pragma(struct cpp_reader *pfile)
{
  mchp_handle_configset_pragma(pfile, "ABF2");
}

#endif /* _BUILD_C32_ */

#endif /* TARGET_MCHP_PIC32MX */
#endif /* _BUILD_MCHP_ */

